def dec_len(n):
    tem = '%d' % n
    lofn = len(tem)
    beginnum = '%d' % (int(tem[0:(lofn - 3)]) + 1)
    for i in range(lofn - len(tem[0:(lofn - 3)])):
        beginnum = beginnum + '0'
    return int(beginnum)


t = 50963

print(dec_len(t))
print(8 ** (1.0 / 3), "   ------   ", 2 ** 3, 3 ** 2, 81 ** (1 / 4.0))

# 0
# “一个人只要还有眼泪，就绝不会是无情之人。”
# “哦？不流泪的人难道都是无情？”
# “不是、当一个人被伤害的次数渐渐增多，慢慢地就会隐藏自己的情感，不再轻易表露，从而保护自己、封闭自己，使其在他人眼里冷酷无情。”
# “这么说，无情都是由多情演变过来的？”
# “可以这么说，无情人隐藏自己的情感远远要比多情人容易得多，可是等到他们控制不住时，泪水也往往要比多情人流的更多，只是没人看到而已。”
# “这世上原本就没有无情人，又何来无情之说？”
# “嗯！不必去说。”matplotlib
# “也没有任何一个人可以做到真正无情？”
# “绝没有！”
